In [8]:
import pandas as pd

In [11]:
titanic = pd.read_csv('Titanic.csv')

In [12]:
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [14]:
female = titanic[titanic['sex'] == 'female']

In [15]:
print(female.head(8))

    pclass  survived                                               name  \
0        1         1                      Allen, Miss. Elisabeth Walton
2        1         0                       Allison, Miss. Helen Loraine
4        1         0    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
6        1         1                  Andrews, Miss. Kornelia Theodosia
8        1         1      Appleton, Mrs. Edward Dale (Charlotte Lamson)
11       1         1  Astor, Mrs. John Jacob (Madeleine Talmadge Force)
12       1         1                      Aubart, Mme. Leontine Pauline
13       1         1                       Barber, Miss. Ellen "Nellie"

       sex   age  sibsp  parch    ticket      fare    cabin embarked boat  \
0   female  29.0      0      0     24160  211.3375       B5        S    2
2   female   2.0      1      2    113781  151.5500  C22 C26        S  NaN
4   female  25.0      1      2    113781  151.5500  C22 C26        S  NaN
6   female  63.0      1      0     13502   77.9583       D7        S   10
8   female  53.0      2      0     11769   51.4792     C101        S    D
11  female  18.0      1      0  PC 17757  227.5250  C62 C64        C    4
12  female  24.0      0      0  PC 17477   69.3000      B35        C    9
13  female  26.0      0      0     19877   78.8500      NaN        S    6

    body                        home.dest
0    NaN                     St Louis, MO
2    NaN  Montreal, PQ / Chesterville, ON
4    NaN  Montreal, PQ / Chesterville, ON
6    NaN                       Hudson, NY
8    NaN              Bayside, Queens, NY
11   NaN                     New York, NY
12   NaN                    Paris, France
13   NaN                              NaN

In [19]:
survived = female[female['survived'] == 1].shape[0]
not_survived = female[female['survived'] == 0].shape[0]

In [20]:
print("Number of female passengers who survived:", survived)
print("Number of female passengers who did not survive:", not_survived)

Number of female passengers who survived: 339
Number of female passengers who did not survive: 127

In [21]:
survived_by_class = female[female['survived'] == 1].groupby('pclass').size()
not_survived_by_class = female[female['survived'] == 0].groupby('pclass').size()

In [22]:
print("Number of female passengers who survived by class:")
print(survived_by_class)

Number of female passengers who survived by class:
pclass
1    139
2     94
3    106
dtype: int64

In [24]:
print("\nNumber of female passengers who did not survive by class:")
print(not_survived_by_class)

Number of female passengers who did not survive by class:
pclass
1      5
2     12
3    110
dtype: int64

In [27]:
adult_passengers = titanic[titanic['age'] > 18]

In [28]:
print(adult_passengers)

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5          1         1                              Anderson, Mr. Harry
6          1         1                Andrews, Miss. Kornelia Theodosia
...      ...       ...                                              ...
1299       3         0                              Yasbeck, Mr. Antoni
1301       3         0                             Youseff, Mr. Gerious
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

         sex   age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0      0      0   24160  211.3375       B5        S    2
3       male  30.0      1      2  113781  151.5500  C22 C26        S  NaN
4     female  25.0      1      2  113781  151.5500  C22 C26        S  NaN
5       male  48.0      0      0   19952   26.5500      E12        S    3
6     female  63.0      1      0   13502   77.9583       D7        S   10
...      ...   ...    ...    ...     ...       ...      ...      ...  ...
1299    male  27.0      1      0    2659   14.4542      NaN        C    C
1301    male  45.5      0      0    2628    7.2250      NaN        C  NaN
1306    male  26.5      0      0    2656    7.2250      NaN        C  NaN
1307    male  27.0      0      0    2670    7.2250      NaN        C  NaN
1308    male  29.0      0      0  315082    7.8750      NaN        S  NaN

       body                        home.dest
0       NaN                     St Louis, MO
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
5       NaN                     New York, NY
6       NaN                       Hudson, NY
...     ...                              ...
1299    NaN                              NaN
1301  312.0                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN

[853 rows x 14 columns]

In [29]:
adult_female_passengers = titanic[(titanic['age'] > 18) & (titanic['sex'] == 'female')]

In [30]:
print(adult_female_passengers)

      pclass  survived                                               name  \
0          1         1                      Allen, Miss. Elisabeth Walton
4          1         0    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
6          1         1                  Andrews, Miss. Kornelia Theodosia
8          1         1      Appleton, Mrs. Edward Dale (Charlotte Lamson)
12         1         1                      Aubart, Mme. Leontine Pauline
...      ...       ...                                                ...
1261       3         1                             Turkula, Mrs. (Hedwig)
1267       3         0  Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...
1276       3         0  Vander Planke, Mrs. Julius (Emelia Maria Vande...
1286       3         1    Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
1290       3         1                   Wilkes, Mrs. James (Ellen Needs)

         sex   age  sibsp  parch    ticket      fare    cabin embarked boat  \
0     female  29.0      0      0     24160  211.3375       B5        S    2
4     female  25.0      1      2    113781  151.5500  C22 C26        S  NaN
6     female  63.0      1      0     13502   77.9583       D7        S   10
8     female  53.0      2      0     11769   51.4792     C101        S    D
12    female  24.0      0      0  PC 17477   69.3000      B35        C    9
...      ...   ...    ...    ...       ...       ...      ...      ...  ...
1261  female  63.0      0      0      4134    9.5875      NaN        S   15
1267  female  30.0      1      1    345773   24.1500      NaN        S  NaN
1276  female  31.0      1      0    345763   18.0000      NaN        S  NaN
1286  female  38.0      0      0      2688    7.2292      NaN        C    C
1290  female  47.0      1      0    363272    7.0000      NaN        S  NaN

      body                        home.dest
0      NaN                     St Louis, MO
4      NaN  Montreal, PQ / Chesterville, ON
6      NaN                       Hudson, NY
8      NaN              Bayside, Queens, NY
12     NaN                    Paris, France
...    ...                              ...
1261   NaN                              NaN
1267   NaN                              NaN
1276   NaN                              NaN
1286   NaN                              NaN
1290   NaN                              NaN

[296 rows x 14 columns]

In [31]:
selected_passengers = titanic[(titanic['age'] > 18) & (titanic['sex'] == 'female') & (titanic['pclass'] == 1)]

In [32]:
print(selected_passengers)

     pclass  survived                                             name  \
0         1         1                    Allen, Miss. Elisabeth Walton
4         1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
6         1         1                Andrews, Miss. Kornelia Theodosia
8         1         1    Appleton, Mrs. Edward Dale (Charlotte Lamson)
12        1         1                    Aubart, Mme. Leontine Pauline
..      ...       ...                                              ...
311       1         1       Wick, Mrs. George Dennick (Mary Hitchcock)
314       1         1     Widener, Mrs. George Dunton (Eleanor Elkins)
315       1         1                         Willard, Miss. Constance
319       1         1                        Wilson, Miss. Helen Alice
322       1         1                         Young, Miss. Marie Grice

        sex   age  sibsp  parch    ticket      fare    cabin embarked  boat  \
0    female  29.0      0      0     24160  211.3375       B5        S     2
4    female  25.0      1      2    113781  151.5500  C22 C26        S   NaN
6    female  63.0      1      0     13502   77.9583       D7        S    10
8    female  53.0      2      0     11769   51.4792     C101        S     D
12   female  24.0      0      0  PC 17477   69.3000      B35        C     9
..      ...   ...    ...    ...       ...       ...      ...      ...   ...
311  female  45.0      1      1     36928  164.8667      NaN        S     8
314  female  50.0      1      1    113503  211.5000      C80        C     4
315  female  21.0      0      0    113795   26.5500      NaN        S  8 10
319  female  31.0      0      0     16966  134.5000  E39 E41        C     3
322  female  36.0      0      0  PC 17760  135.6333      C32        C     8

     body                        home.dest
0     NaN                     St Louis, MO
4     NaN  Montreal, PQ / Chesterville, ON
6     NaN                       Hudson, NY
8     NaN              Bayside, Queens, NY
12    NaN                    Paris, France
..    ...                              ...
311   NaN                   Youngstown, OH
314   NaN                  Elkins Park, PA
315   NaN                       Duluth, MN
319   NaN                              NaN
322   NaN    New York, NY / Washington, DC

[120 rows x 14 columns]

In [33]:
selected_passengers = titanic[(titanic['age'] > 18) & (titanic['sex'] == 'female') & (titanic['pclass'] == 1)]

In [35]:
mean_age = selected_passengers['age'].mean()

In [36]:
print("Mean age of selected passengers:", mean_age)

Mean age of selected passengers: 39.358333333333334

In [38]:
selected_passengers = titanic[((titanic['age'] > 18) | (titanic['sex'] == 'female')) & (titanic['pclass'] == 1)]

In [39]:
print(selected_passengers)

     pclass  survived                                             name  \
0         1         1                    Allen, Miss. Elisabeth Walton
2         1         0                     Allison, Miss. Helen Loraine
3         1         0             Allison, Mr. Hudson Joshua Creighton
4         1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
5         1         1                              Anderson, Mr. Harry
..      ...       ...                                              ...
316       1         0                      Williams, Mr. Charles Duane
317       1         1                  Williams, Mr. Richard Norris II
319       1         1                        Wilson, Miss. Helen Alice
321       1         0                               Wright, Mr. George
322       1         1                         Young, Miss. Marie Grice

        sex   age  sibsp  parch    ticket      fare    cabin embarked boat  \
0    female  29.0      0      0     24160  211.3375       B5        S    2
2    female   2.0      1      2    113781  151.5500  C22 C26        S  NaN
3      male  30.0      1      2    113781  151.5500  C22 C26        S  NaN
4    female  25.0      1      2    113781  151.5500  C22 C26        S  NaN
5      male  48.0      0      0     19952   26.5500      E12        S    3
..      ...   ...    ...    ...       ...       ...      ...      ...  ...
316    male  51.0      0      1  PC 17597   61.3792      NaN        C  NaN
317    male  21.0      0      1  PC 17597   61.3792      NaN        C    A
319  female  31.0      0      0     16966  134.5000  E39 E41        C    3
321    male  62.0      0      0    113807   26.5500      NaN        S  NaN
322  female  36.0      0      0  PC 17760  135.6333      C32        C    8

      body                         home.dest
0      NaN                      St Louis, MO
2      NaN   Montreal, PQ / Chesterville, ON
3    135.0   Montreal, PQ / Chesterville, ON
4      NaN   Montreal, PQ / Chesterville, ON
5      NaN                      New York, NY
..     ...                               ...
316    NaN  Geneva, Switzerland / Radnor, PA
317    NaN  Geneva, Switzerland / Radnor, PA
319    NaN                               NaN
321    NaN                       Halifax, NS
322    NaN     New York, NY / Washington, DC

[287 rows x 14 columns]

In [41]:
selected_passengers = titanic[(titanic['age'] > 18) | ((titanic['sex'] == 'female') & (titanic['pclass'] == 1))]

In [43]:
mean_age = selected_passengers['age'].mean()

In [44]:
print("Mean age of selected passengers:", mean_age)

Mean age of selected passengers: 33.89722863741339